worrajak/nRF52840/src/main.cpp
struct RssiSample {
    uint32_t timestamp;   // ms since boot
    uint8_t  nodeId;      // THIS_NODE (who logged this)
    uint8_t  srcNode;     // original source (from payload or header)
    uint8_t  rhFrom;      // who actually sent this packet (relay or origin)
    uint8_t  hopCount;    // 0-3
    int16_t  rssi;        // dBm
    int16_t  snr;         // dB (if available)
    uint8_t  decision;    // RELAY_STATUS_* enum
    uint8_t  flags;       // ACK/RELAYED/CRC_FAIL
} __attribute__((packed));

#define RELAY_STATUS_IDLE     0
#define RELAY_STATUS_QUEUED   1
#define RELAY_STATUS_SENT     2
#define RELAY_STATUS_CANCEL   3
#define RELAY_STATUS_NO_RELAY 4
#define RELAY_STATUS_DROP_DUP 5
#define RELAY_STATUS_DROP_Q   6
#define RELAY_STATUS_DROP_HOP 7
#define RELAY_STATUS_DROP_CRC 8
#define RELAY_STATUS_DROP_ECHO 9
#define RELAY_STATUS_ACK_RCVD 10

RssiSample rssiLog[RSSI_LOG_SIZE];
uint16_t rssiLogHead = 0;
uint16_t rssiLogCount = 0;
#ifndef DEG_TO_RAD
#define DEG_TO_RAD  0.017453292519943295
#endif
#ifndef RAD_TO_DEG
#define RAD_TO_DEG  57.29577951308232
#endif
#define EARTH_RADIUS_M              6371000.0

// ============ GLOBALS ============
Adafruit_SSD1306 display(128, 64, &Wire, -1);
Adafruit_BME280 bme;

float batteryVoltage = 0;
uint16_t batteryMV = 3300;
bool oled_ok = false;
bool lora_ok = false;
bool bme_ok = false;
bool ble_ok = false;
bool ble_connected = false;
int16_t temperature = 25;  // simulated default
int16_t humidity = 50;     // simulated default

// GPS from phone via BLE
double myLat = 0.0;
double myLon = 0.0;
float myHeading = -1;  // -1 = no heading available
bool gpsValid = false;
uint32_t gpsLastUpdate = 0;

// Tracked node positions (from received LoRa packets)
struct NodePosition {
    uint8_t nodeId;
    double lat;
    double lon;
    int16_t rssi;
    uint32_t lastSeen;
    bool valid;
} trackedNodes[MAX_TRACKED_NODES];

// LoRa state
volatile bool lora_rx_flag = false;
uint8_t txSequenceNum = 0;
uint8_t rhMsgId = 0;

// OLED UI and latest radio activity
uint8_t uiPage = 0;
bool lastOwnTxOk = false;
bool ownTxAttempted = false;
bool lastRxValid = false;
uint8_t lastRxNode = 0;
uint8_t lastRxFrom = 0;
uint8_t lastRxHop = 0;
int16_t lastRxRssi = 0;
int16_t lastRxTemp = 0;
int16_t lastRxHum = 0;
uint16_t lastRxBat = 0;
char lastRelayStatus[11] = "IDLE";

// Relay: duplicate detection cache
struct RelayCache {
    uint8_t sourceNode;
    uint8_t sequenceNum;
    uint32_t timestamp;
} relayMemory[RELAY_MEMORY_SIZE];
uint8_t relayCacheIndex = 0;

// Relay: message queue for delayed forwarding
struct MessageQueueEntry {
    uint8_t data[MAX_MESSAGE_LEN + 4];
    uint8_t len;
    uint32_t sendTime;
    uint8_t srcNode;   // for cancel-on-heard
    uint8_t seqNum;    // for cancel-on-heard
    bool inUse;
} messageQueue[MESSAGE_QUEUE_SIZE];

// Adaptive RSSI threshold (EMA)
int16_t rssiSourceClose = RSSI_SOURCE_CLOSE_INIT;
uint32_t rssiSampleCount = 0;

// Path success rate (Bayesian)
struct PathStat {
    uint8_t nodeId;
    uint32_t successCount;  // heard relay/ACK back = success
    uint32_t totalCount;    // total packets from this source
} pathStats[PATH_STATS_SIZE];

// ============ DEBUG OUTPUT SYSTEM ============
#define DBG_LINES 5
#define DBG_COLS  22

char dbgBuf[DBG_LINES][DBG_COLS];
uint8_t dbgIdx = 0;

void dbg(const char* msg) {
    Serial.println(msg);
    strncpy(dbgBuf[dbgIdx], msg, DBG_COLS - 1);
    dbgBuf[dbgIdx][DBG_COLS - 1] = '\0';
    dbgIdx = (dbgIdx + 1) % DBG_LINES;
}

void dbgf(const char* fmt, ...) {
    char tmp[80];
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(tmp, sizeof(tmp), fmt, ap);
    va_end(ap);
    dbg(tmp);
}

// Forward declarations for GPS functions defined later
double haversineDistance(double lat1, double lon1, double lat2, double lon2);
float bearingTo(double lat1, double lon1, double lat2, double lon2);
const char* bearingToCompass(float bearing);
NodePosition* findNearestNode();
uint8_t pathSuccessProbability(uint8_t nodeId);

// dtostrf polyfill for ARM GCC
#ifndef dtostrf
static char* dtostrf(double val, signed char width, unsigned char prec, char* s) {
    char fmt[16];
    snprintf(fmt, sizeof(fmt), "%%%d.%df", width, prec);
    sprintf(s, fmt, val);
    return s;
}
#endif

// Draw arrow pointing in a direction (relative bearing)
void drawArrow(int cx, int cy, int r, float angleDeg) {
    float rad = angleDeg * DEG_TO_RAD;
    // Arrow tip
    int tx = cx + (int)(r * sin(rad));
    int ty = cy - (int)(r * cos(rad));
    // Arrow tail
    int bx = cx - (int)((r * 0.4) * sin(rad));
    int by = cy + (int)((r * 0.4) * cos(rad));
    // Arrow wings
    float wingAngle = 0.5f;
    int w1x = cx - (int)((r * 0.5) * sin(rad - wingAngle));
    int w1y = cy + (int)((r * 0.5) * cos(rad - wingAngle));
    int w2x = cx - (int)((r * 0.5) * sin(rad + wingAngle));
    int w2y = cy + (int)((r * 0.5) * cos(rad + wingAngle));
    display.drawLine(tx, ty, w1x, w1y, SSD1306_WHITE);
    display.drawLine(tx, ty, w2x, w2y, SSD1306_WHITE);
    display.drawLine(bx, by, tx, ty, SSD1306_WHITE);
}

void updateOLED() {
    if (!oled_ok) return;
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);

    char line[24];
    display.setCursor(0, 0);
    snprintf(line, sizeof(line), "%d/3 ", uiPage + 1);
    display.print(line);

    if (uiPage == 0) {
        display.println(F("THIS NODE"));
        display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
        display.setCursor(0, 13);
        snprintf(line, sizeof(line), "Node ID:%d LoRa:%s", THIS_NODE_ADDRESS,
                 lora_ok ? "OK" : "FAIL");
        display.println(line);
        snprintf(line, sizeof(line), "T:%dC H:%d%% %s", temperature,
                 humidity, bme_ok ? "" : "(SIM)");
        display.println(line);
        snprintf(line, sizeof(line), "TX#:%d Pwr:%+ddBm", txSequenceNum,
                 currentTxPower);
        display.println(line);
        snprintf(line, sizeof(line), "Radio:%s SF:%d",
                 adaptiveRadio ? "ADAPT" : "FIXED", currentSF);
        display.println(line);
        snprintf(line, sizeof(line), "Last TX:%s",
                 !ownTxAttempted ? "--" : (lastOwnTxOk ? "SENT" : "DROP"));
        display.println(line);
        if (mlMode) {
            snprintf(line, sizeof(line), "ML:%d%% Th:%d", mlProbPct, rssiSourceClose);
        } else {
            snprintf(line, sizeof(line), "Rule Th:%d", rssiSourceClose);
        }
        display.println(line);
    } else if (uiPage == 1) {
        display.println(F("LAST RX / RELAY"));
        display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
        display.setCursor(0, 13);
        if (!lastRxValid) {
            display.println(F("Waiting for packet..."));
            display.println(F("RX RSSI: --"));
            display.println(F("Hop:-- From:--"));
            display.println(F("Relay: IDLE"));
        } else {
            snprintf(line, sizeof(line), "ID:%d From:%d", lastRxNode, lastRxFrom);
            display.println(line);
            snprintf(line, sizeof(line), "Hop:%d RX:%ddBm", lastRxHop, lastRxRssi);
            display.println(line);
            snprintf(line, sizeof(line), "T:%dC H:%d%%", lastRxTemp, lastRxHum);
            display.println(line);
            snprintf(line, sizeof(line), "Relay:%s", lastRelayStatus);
            display.println(line);
            if (lastRxNode != 0) {
                uint8_t prob = pathSuccessProbability(lastRxNode);
                if (mlMode) {
                    snprintf(line, sizeof(line), "ML:%d%% Path:%d%%", mlProbPct, prob);
                } else {
                    snprintf(line, sizeof(line), "Path:%d%% Th:%d", prob, rssiSourceClose);
                }
            } else {
                if (mlMode) {
                    snprintf(line, sizeof(line), "ML:%d%% Th:%d", mlProbPct, rssiSourceClose);
                } else {
                    snprintf(line, sizeof(line), "Thresh:%ddBm", rssiSourceClose);
                }
            }
            display.println(line);
            snprintf(line, sizeof(line), "TX:%+ddBm SF:%d RX:%ddBm",
                     currentTxPower,
                     currentSF, lastRxRssi);
            display.println(line);
        }
    } else {
        display.println(F("DEVICE STATUS"));
        display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
        display.setCursor(0, 13);
        snprintf(line, sizeof(line), "Battery: %.2fV", batteryVoltage);
        display.println(line);
        snprintf(line, sizeof(line), "LoRa:%s OLED:%s", lora_ok ? "OK" : "ERR",
                 oled_ok ? "OK" : "ERR");
        display.println(line);
        snprintf(line, sizeof(line), "BLE:%s %s", ble_ok ? "OK" : "ERR",
                 ble_connected ? "LINK" : "WAIT");
        display.println(line);
        snprintf(line, sizeof(line), "BME:%s GPS:%s", bme_ok ? "OK" : "SIM",
                 gpsValid ? "FIX" : "NO");
        display.println(line);
#if LOW_POWER_IDLE
        display.println(F("Power:IDLE RX-ON"));
#else
        display.println(F("Power:RUN RX-ON"));
#endif
        snprintf(line, sizeof(line), "Uptime:%lus", millis() / 1000UL);
        display.println(line);
    }

