worrajak/nRF52840/src/main.cpp
    display.display();
}

void handleUIButton() {
    static bool rawState = false;
    static bool stableState = false;
    static uint32_t changedAt = 0;
    bool pressed = (nrf_gpio_pin_read(UI_BUTTON_PIN) == 0);

    if (pressed != rawState) {
        rawState = pressed;
        changedAt = millis();
    }
    if ((millis() - changedAt) >= BUTTON_DEBOUNCE_MS &&
        stableState != rawState) {
        stableState = rawState;
        if (stableState) {
            uiPage = (uiPage + 1) % UI_PAGE_COUNT;
            Serial.print(F("[UI] Button pressed, page "));
            Serial.println(uiPage + 1);
            updateOLED();
        }
    }
}

// ============ GPS MATH ============
double haversineDistance(double lat1, double lon1, double lat2, double lon2) {
    double dLat = (lat2 - lat1) * DEG_TO_RAD;
    double dLon = (lon2 - lon1) * DEG_TO_RAD;
    double a = sin(dLat / 2) * sin(dLat / 2) +
               cos(lat1 * DEG_TO_RAD) * cos(lat2 * DEG_TO_RAD) *
               sin(dLon / 2) * sin(dLon / 2);
    double c = 2 * atan2(sqrt(a), sqrt(1 - a));
    return EARTH_RADIUS_M * c;
}

// Returns bearing in degrees (0=N, 90=E, 180=S, 270=W)
float bearingTo(double lat1, double lon1, double lat2, double lon2) {
    double dLon = (lon2 - lon1) * DEG_TO_RAD;
    double y = sin(dLon) * cos(lat2 * DEG_TO_RAD);
    double x = cos(lat1 * DEG_TO_RAD) * sin(lat2 * DEG_TO_RAD) -
               sin(lat1 * DEG_TO_RAD) * cos(lat2 * DEG_TO_RAD) * cos(dLon);
    float brng = (float)(atan2(y, x) * RAD_TO_DEG);
    return fmod(brng + 360.0f, 360.0f);
}

const char* bearingToCompass(float bearing) {
    static const char* dirs[] = {"N","NE","E","SE","S","SW","W","NW"};
    int idx = (int)((bearing + 22.5f) / 45.0f) % 8;
    return dirs[idx];
}

// Find nearest tracked node with valid GPS
NodePosition* findNearestNode() {
    NodePosition* nearest = nullptr;
    double minDist = 999999999.0;
    uint32_t now = millis();
    for (int i = 0; i < MAX_TRACKED_NODES; i++) {
        if (!trackedNodes[i].valid) continue;
        if ((now - trackedNodes[i].lastSeen) > NODE_POSITION_TTL) continue;
        if (trackedNodes[i].lat == 0.0 && trackedNodes[i].lon == 0.0) continue;
        double d = haversineDistance(myLat, myLon, trackedNodes[i].lat, trackedNodes[i].lon);
        if (d < minDist) {
            minDist = d;
            nearest = &trackedNodes[i];
        }
    }
    return nearest;
}

void updateTrackedNode(uint8_t nodeId, double lat, double lon, int16_t rssi) {
    // Find existing or oldest slot
    int slot = -1;
    uint32_t oldest = 0xFFFFFFFF;
    for (int i = 0; i < MAX_TRACKED_NODES; i++) {
        if (trackedNodes[i].nodeId == nodeId && trackedNodes[i].valid) {
            slot = i;
            break;
        }
        if (!trackedNodes[i].valid) {
            slot = i;
            break;
        }
        if (trackedNodes[i].lastSeen < oldest) {
            oldest = trackedNodes[i].lastSeen;
            slot = i;
        }
    }
    if (slot < 0) slot = 0;
    trackedNodes[slot].nodeId = nodeId;
    trackedNodes[slot].lat = lat;
    trackedNodes[slot].lon = lon;
    trackedNodes[slot].rssi = rssi;
    trackedNodes[slot].lastSeen = millis();
    trackedNodes[slot].valid = true;
}

// ============ BLE GPS SERVICE ============
class GpsCallbacks : public NimBLECharacteristicCallbacks {
    void onWrite(NimBLECharacteristic* pChar, NimBLEConnInfo& connInfo) {
        std::string val = pChar->getValue();
        // Expected format: "lat,lon" or "lat,lon,heading"
        // e.g. "13.7563,100.5018" or "13.7563,100.5018,45.2"
        if (val.length() < 5) return;

        char buf[64];
        strncpy(buf, val.c_str(), sizeof(buf) - 1);
        buf[sizeof(buf) - 1] = '\0';

        char* tok = strtok(buf, ",");
        if (!tok) return;
        double lat = atof(tok);

        tok = strtok(NULL, ",");
        if (!tok) return;
        double lon = atof(tok);

        tok = strtok(NULL, ",");
        if (tok) {
            myHeading = atof(tok);
        }

        if (lat != 0.0 && lon != 0.0) {
            myLat = lat;
            myLon = lon;
            gpsValid = true;
            gpsLastUpdate = millis();
            dbgf("BLE GPS:%.4f,%.4f", myLat, myLon);
            updateOLED();
        }
    }
};

class ServerCallbacks : public NimBLEServerCallbacks {
    void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) {
        ble_connected = true;
        dbg("BLE: connected");
        updateOLED();
    }
    void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) {
        ble_connected = false;
        dbg("BLE: disconnected");
        NimBLEDevice::startAdvertising();
        updateOLED();
    }
};

static GpsCallbacks gpsCallbacks;
static ServerCallbacks serverCallbacks;

// BLE Data characteristic callback — triggers DATADUMP on write
class DataCallbacks : public NimBLECharacteristicCallbacks {
    void onWrite(NimBLECharacteristic* pChar, NimBLEConnInfo& connInfo) {
        std::string val = pChar->getValue();
        if (val == "DUMP") {
            // Build CSV string and set as characteristic value
            // Max BLE MTU is ~512, so we chunk
            char buf[256];
            int pos = 0;
            uint16_t count = (rssiLogCount < RSSI_LOG_SIZE) ? rssiLogCount : RSSI_LOG_SIZE;
            uint16_t start = (rssiLogCount < RSSI_LOG_SIZE) ? 0 :
                             (rssiLogHead % RSSI_LOG_SIZE);
            pos += snprintf(buf + pos, sizeof(buf) - pos, "ts,node,src,from,hop,rssi,snr,decision,flags\n");
            for (uint16_t i = 0; i < count && pos < 240; i++) {
                uint16_t idx = (start + i) % RSSI_LOG_SIZE;
                RssiSample* s = &rssiLog[idx];
                pos += snprintf(buf + pos, sizeof(buf) - pos,
                                "%lu,%u,%u,%u,%u,%d,%s%d.%02d,%u,%02X\n",
                                s->timestamp, s->nodeId, s->srcNode, s->rhFrom,
                                s->hopCount, s->rssi,
                                (s->snr < 0 ? "-" : ""),
                                (s->snr < 0 ? -s->snr : s->snr) / 4,
                                ((s->snr < 0 ? -s->snr : s->snr) % 4) * 25,
                                s->decision, s->flags);
            }
            pChar->setValue((uint8_t*)buf, pos);
            dbgf("BLE: sent %d bytes RSSI log", pos);
        } else if (val == "CLEAR") {
            rssiLogHead = 0;
            rssiLogCount = 0;
            pChar->setValue("CLEARED");
            dbg("BLE: RSSI log cleared");
        }
    }
};
static DataCallbacks dataCallbacks;

