worrajak/nRF52840/src/main.cpp
// OpMode values (LoRa mode = bit 7 set)
#define RFM95_MODE_SLEEP        0x80
#define RFM95_MODE_STANDBY      0x81
#define RFM95_MODE_TX           0x83
#define RFM95_MODE_RX_CONT      0x85

// IRQ flags
#define RFM95_IRQ_TX_DONE       0x08
#define RFM95_IRQ_RX_DONE       0x40
#define RFM95_IRQ_CRC_ERROR     0x20

void rfm95WriteReg(uint8_t addr, uint8_t value) {
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(addr | 0x80);  // bit 7 = write
    swSpiTransfer(value);
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

uint8_t rfm95ReadReg(uint8_t addr) {
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(addr & 0x7F);  // bit 7 = 0 for read
    uint8_t val = swSpiTransfer(0x00);
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
    return val;
}

void rfm95WriteBurst(uint8_t addr, const uint8_t* data, uint8_t len) {
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(addr | 0x80);
    for (uint8_t i = 0; i < len; i++) {
        swSpiTransfer(data[i]);
    }
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

void rfm95ReadBurst(uint8_t addr, uint8_t* data, uint8_t len) {
    gpioClear(LORA_CS);
    delayMicroseconds(5);
    swSpiTransfer(addr & 0x7F);
    for (uint8_t i = 0; i < len; i++) {
        data[i] = swSpiTransfer(0x00);
    }
    delayMicroseconds(5);
    gpioSet(LORA_CS);
    delayMicroseconds(5);
}

#endif // USE_RFM95

// ============ ENCRYPTION (XOR — matches STM32) ============
void xorEncrypt(const char* plaintext, int len, uint8_t* output) {
    for (int i = 0; i < len; i++) {
        output[i] = plaintext[i] ^ CRYPTO_KEY[i % CRYPTO_KEY_LEN];
    }
}

void xorDecrypt(const uint8_t* ciphertext, int len, char* output) {
    for (int i = 0; i < len; i++) {
        output[i] = ciphertext[i] ^ CRYPTO_KEY[i % CRYPTO_KEY_LEN];
    }
    output[len] = '\0';
}

// ============ CRC16 (matches STM32) ============
uint16_t calculateCRC16(const uint8_t* data, uint8_t length) {
    uint16_t crc = 0xFFFF;
    for (int i = 0; i < length; i++) {
        crc ^= (uint16_t)data[i];
        for (int j = 0; j < 8; j++) {
            if (crc & 1) {
                crc = (crc >> 1) ^ 0xA001;
            } else {
                crc >>= 1;
            }
        }
    }
    return crc;
}

// ============ MODEM MODES ============
#ifdef USE_SX1262
void setModeRx() {
    sx1262ClearIrqStatus();
    uint8_t p[3] = {0xFF, 0xFF, 0xFF};  // continuous RX
    sx1262WriteCommand(0x82, p, 3);
}
void setModeSleep() {
    uint8_t p = 0x00;
    sx1262WriteCommand(0x84, &p, 1);
}
#endif

#ifdef USE_RFM95
void setModeRx() {
    rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);  // clear IRQ
    rfm95WriteReg(RFM95_REG_FIFO_ADDR_PTR, 0x00);
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_RX_CONT);
}
void setModeSleep() {
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_SLEEP);
}
#endif

// DIO interrupt handler (SX1262=DIO1, RFM95=DIO0)
void lora_isr() {
    lora_rx_flag = true;
}

// ============ RELAY: DUPLICATE DETECTION ============
bool isMessageDuplicate(uint8_t sourceNode, uint8_t seqNum) {
    uint32_t now = millis();
    for (int i = 0; i < RELAY_MEMORY_SIZE; i++) {
        if (relayMemory[i].sourceNode == sourceNode &&
            relayMemory[i].sequenceNum == seqNum &&
            (now - relayMemory[i].timestamp) < RELAY_CACHE_TTL) {
            return true;
        }
    }
    return false;
}

void addToRelayCache(uint8_t sourceNode, uint8_t seqNum) {
    relayMemory[relayCacheIndex].sourceNode = sourceNode;
    relayMemory[relayCacheIndex].sequenceNum = seqNum;
    relayMemory[relayCacheIndex].timestamp = millis();
    relayCacheIndex = (relayCacheIndex + 1) % RELAY_MEMORY_SIZE;
}

// ============ RELAY: MESSAGE QUEUE ============
// RSSI-based forwarding delay: best relay (highest RSSI) sends first
static uint32_t rssiToDelayMs(int16_t rssi) {
    if      (rssi >= -75)  return RSSI_DELAY_GOOD;
    else if (rssi >= -90)  return RSSI_DELAY_FAIR;
    else if (rssi >= -105) return RSSI_DELAY_WEAK;
    else                   return RSSI_DELAY_POOR;
}

// ============ ADAPTIVE RADIO: TX Power + SF ============
// Map RSSI → TX power (dBm) — ปลอดภัยตาม กสทช. 920-925 MHz ≤ 500 mW EIRP
static uint8_t rssiToTxPower(int16_t rssi) {
    if      (rssi >= -75)  return ADAPTIVE_POWER_MIN;   // ใกล้ → ลดกำลัง
    else if (rssi >= -90)  return ADAPTIVE_POWER_MED;   // ปานกลาง
    else if (rssi >= -105) return ADAPTIVE_POWER_HIGH;  // ไกล → เพิ่มกำลัง
    else                   return ADAPTIVE_POWER_MAX;   // ไกลมาก → กำลังสูงสุด
}

// Map RSSI → Spreading Factor (SF7–SF12)
// SF สูง = ระยะไกลขึ้น แต่ data rate ต่ำลง, ToF นานขึ้น
static uint8_t rssiToSF(int16_t rssi) {
    if      (rssi >= -75)  return ADAPTIVE_SF_GOOD;
    else if (rssi >= -90)  return ADAPTIVE_SF_FAIR;
    else if (rssi >= -105) return ADAPTIVE_SF_WEAK;
    else                   return ADAPTIVE_SF_POOR;
}

// Apply TX power to radio hardware (called before each TX)
// SF คงที่ 7 เสมอ — ถ้าเปลี่ยน SF จะทำให้ RX ไม่ตรงกับ node อื่น
static void applyRadioParams(uint8_t txPower) {
#ifdef USE_SX1262
    sx1262SetStandby();
    delay(1);
    // Set TX power only
    uint8_t txParams[2] = {txPower, 0x04};  // dBm, ramp 200us
    sx1262WriteCommand(0x8E, txParams, 2);
#endif
#ifdef USE_RFM95
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_STANDBY);
    delay(1);
    // Set TX power: PA_BOOST, OutputPower = txPower - 2
    uint8_t paVal = 0x80 | (txPower - 2);
    if (txPower > 17) paVal = 0x80 | 15;  // clamp to max reg value
    rfm95WriteReg(RFM95_REG_PA_CONFIG, paVal);
#endif
    currentTxPower = txPower;
    currentSF = 7;  // SF คงที่ (SF10 สำหรับป่าไม้)
}

void addToMessageQueue(const uint8_t* packet, uint8_t len,
                       uint8_t srcNode, uint8_t seqNum, int16_t rssi) {
    for (int i = 0; i < MESSAGE_QUEUE_SIZE; i++) {
        if (!messageQueue[i].inUse) {
            memcpy(messageQueue[i].data, packet, len);
            messageQueue[i].len = len;
            messageQueue[i].srcNode = srcNode;
            messageQueue[i].seqNum = seqNum;
            uint32_t delayMs = rssiToDelayMs(rssi);
            messageQueue[i].sendTime = millis() + delayMs;
            messageQueue[i].inUse = true;
            strncpy(lastRelayStatus, "QUEUED", sizeof(lastRelayStatus));
            dbgf("RELAY Q N:%d S:%d +%lums RSSI:%d",
                 srcNode, seqNum, delayMs, rssi);
            return;
        }
    }
    strncpy(lastRelayStatus, "DROP-Q", sizeof(lastRelayStatus));
    dbg("RELAY Q full!");
}

// Cancel-on-heard: if we hear another relay forward the same packet, cancel ours
void cancelFromQueue(uint8_t srcNode, uint8_t seqNum) {
    for (int i = 0; i < MESSAGE_QUEUE_SIZE; i++) {
        if (messageQueue[i].inUse &&
            messageQueue[i].srcNode == srcNode &&
            messageQueue[i].seqNum == seqNum) {
            messageQueue[i].inUse = false;
            strncpy(lastRelayStatus, "CANCEL", sizeof(lastRelayStatus));
            dbgf("RELAY CANCEL N:%d S:%d (heard other relay)", srcNode, seqNum);
            return;
        }
    }
}

