worrajak/nRF52840/src/main.cpp
void sendRawPacket(const uint8_t* packet, uint8_t len) {
#ifdef FW_MEAS_MODE
    {   uint32_t mseq = (len >= 9 && packet[4] == 'M')
            ? ((uint32_t)packet[5] << 24 | (uint32_t)packet[6] << 16 |
               (uint32_t)packet[7] << 8  | (uint32_t)packet[8]) : 0;
        meas_log_tx(packet[0], mseq, (len >= 5 ? (char)packet[4] : '?'),
                    (uint8_t)(packet[3] & 0x0F), len, true);
    }
#endif
    // Apply adaptive radio params before relay TX
    // Relay ไม่มี ACK feedback → ใช้ silence timeout + RSSI
    // [MEAS] โหมดวัดตรึงกำลังส่ง — adaptive power (7→17 dBm ตาม RSSI) ทำให้
    // RSSI-vs-distance กลายเป็นลูปป้อนกลับ ไม่ใช่ path loss ล้วน
    if (adaptiveRadio && !MEAS_FREEZE_POWER) {
        uint8_t pwr;
        if (millis() - lastHeardTime > SILENCE_TIMEOUT_MS) {
            pwr = ADAPTIVE_POWER_MAX;
        } else {
            int16_t refRssi = (lastRxValid && lastRxRssi < 0) ? lastRxRssi : rssiSourceClose;
            pwr = rssiToTxPower(refRssi);
        }
        applyRadioParams(pwr);
    }
#ifdef USE_SX1262
    sx1262SetStandby();
    delay(2);
    uint8_t pktParams[6] = {0x00, 0x08, 0x00, len, 0x01, 0x00};
    sx1262WriteCommand(0x8C, pktParams, 6);
    sx1262WriteBuffer(0x00, packet, len);
    sx1262ClearIrqStatus();
    uint8_t txP[3] = {0x00, 0x00, 0x00};
    sx1262WriteCommand(0x83, txP, 3);
    uint32_t txStart = millis();
    bool sent = false;
    while (millis() - txStart < 2000) {
        uint16_t irq = sx1262GetIrqStatus();
        if (irq & 0x0001) {
            sx1262ClearIrqStatus();
            sent = true;
            break;
        }
        delay(1);
    }
#endif
#ifdef USE_RFM95
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_STANDBY);
    delay(2);
    rfm95WriteReg(RFM95_REG_FIFO_ADDR_PTR, 0x00);
    rfm95WriteBurst(RFM95_REG_FIFO, packet, len);
    rfm95WriteReg(RFM95_REG_PAYLOAD_LEN, len);
    rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_TX);
    uint32_t txStart = millis();
    bool sent = false;
    while (millis() - txStart < 2000) {
        if (rfm95ReadReg(RFM95_REG_IRQ_FLAGS) & RFM95_IRQ_TX_DONE) {
            rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
            sent = true;
            break;
        }
        delay(1);
    }
#endif
    setModeRx();
    strncpy(lastRelayStatus, sent ? "SENT" : "DROP-TX",
            sizeof(lastRelayStatus));
    dbg(sent ? "RELAY TX OK" : "RELAY TX timeout!");
    updateOLED();
}

void processMessageQueue() {
    uint32_t now = millis();
    for (int i = 0; i < MESSAGE_QUEUE_SIZE; i++) {
        if (messageQueue[i].inUse && now >= messageQueue[i].sendTime) {
            sendRawPacket(messageQueue[i].data, messageQueue[i].len);
            messageQueue[i].inUse = false;
        }
    }
}

// ============ MODEM CONFIG ============
#ifdef USE_SX1262
bool configureLoRaModem() {
    uint8_t pktType = 0x01;
    sx1262WriteCommand(0x8A, &pktType, 1);
    // 923 MHz: freq_raw = freq_hz * 2^25 / 32MHz
    uint32_t frf = (uint32_t)((923000000.0 / 32000000.0) * (1 << 25));
    uint8_t freqParams[4] = {
        (uint8_t)((frf >> 24) & 0xFF), (uint8_t)((frf >> 16) & 0xFF),
        (uint8_t)((frf >> 8) & 0xFF),  (uint8_t)(frf & 0xFF)
    };
    sx1262WriteCommand(0x86, freqParams, 4);
    uint8_t paConfig[4] = {0x04, 0x07, 0x00, 0x01};  // +22 dBm capable
    sx1262WriteCommand(0x95, paConfig, 4);
    uint8_t txParams[2] = {12, 0x04};  // 12 dBm, ramp 200us
    sx1262WriteCommand(0x8E, txParams, 2);
    uint8_t modParams[4] = {0x07, 0x04, 0x01, 0x00};  // SF7, BW125, CR4/5 (SF10=0xA0 สำหรับป่าไม้)
    sx1262WriteCommand(0x8B, modParams, 4);
    uint8_t pktParams[6] = {0x00, 0x08, 0x00, 0xFF, 0x01, 0x00};
    sx1262WriteCommand(0x8C, pktParams, 6);
    uint8_t bufBase[2] = {0x00, 0x80};
    sx1262WriteCommand(0x8F, bufBase, 2);
    uint8_t irqParams[8] = {0x02, 0x03, 0x02, 0x03, 0x00, 0x00, 0x00, 0x00};
    sx1262WriteCommand(0x08, irqParams, 8);
    uint8_t calFreq[2] = {0xE1, 0xE9};
    sx1262WriteCommand(0x98, calFreq, 2);
    // Sync word 0x1424 = public (compatible with SX1276 sync=0x12)
    sx1262WriteRegister(0x0740, 0x14);
    sx1262WriteRegister(0x0741, 0x24);
    return true;
}
#endif

#ifdef USE_RFM95
bool configureLoRaModem() {
    // 923 MHz: frf = freq / 61.035 Hz step
    uint32_t frf = (uint32_t)(923000000.0 / 61.03515625);
    rfm95WriteReg(RFM95_REG_FRF_MSB, (frf >> 16) & 0xFF);
    rfm95WriteReg(RFM95_REG_FRF_MID, (frf >> 8) & 0xFF);
    rfm95WriteReg(RFM95_REG_FRF_LSB, frf & 0xFF);
    // PA config: PA_BOOST, power=12 dBm (OutputPower = 12 - 2 = 10 → reg 0x8A)
    rfm95WriteReg(RFM95_REG_PA_CONFIG, 0x80 | (12 - 2));
    rfm95WriteReg(RFM95_REG_OCP, 0x2B);  // OCP 100mA
    rfm95WriteReg(RFM95_REG_LNA, 0x23);  // LNA max gain
    // Modem config: BW=125kHz(0x70), CR=4/5(0x02), explicit header(0x00)
    rfm95WriteReg(RFM95_REG_MODEM_CFG1, 0x72);
    // SF=7(0x70), CRC on(0x04) — SF10(0xA0) สำหรับป่าไม้
    rfm95WriteReg(RFM95_REG_MODEM_CFG2, 0x74);
    // LDRO off, AGC auto
    rfm95WriteReg(RFM95_REG_MODEM_CFG3, 0x04);
    // Preamble = 8
    rfm95WriteReg(RFM95_REG_PREAMBLE_MSB, 0x00);
    rfm95WriteReg(RFM95_REG_PREAMBLE_LSB, 0x08);
    // Sync word 0x12 (public, compatible with SX1262 0x1424)
    rfm95WriteReg(RFM95_REG_SYNC_WORD, 0x12);
    // DIO0 = RxDone (00), DIO1 = RxTimeout (01)
    rfm95WriteReg(RFM95_REG_DIO_MAPPING1, 0x00);
    // FIFO base addresses
    rfm95WriteReg(RFM95_REG_FIFO_TX_BASE, 0x00);
    rfm95WriteReg(RFM95_REG_FIFO_RX_BASE, 0x00);
    return true;
}
#endif

// ============ LORA INIT ============
bool initLoRa() {
    // Common SPI pin setup
    gpioOutput(LORA_CS);
    gpioSet(LORA_CS);
    gpioInput(LORA_IRQ);
    gpioOutput(LORA_RST);
    gpioSet(LORA_RST);
    gpioOutput(LORA_MOSI);
    gpioOutput(LORA_SCK);
    gpioInput(LORA_MISO);
    gpioClear(LORA_MOSI);
    gpioClear(LORA_SCK);

#ifdef USE_SX1262
    dbg("SX1262: init...");
    updateOLED();
    gpioInput(LORA_BUSY);
    delay(10);

    // Reset
    dbg("SX1262: reset...");
    updateOLED();
    gpioClear(LORA_RST);
    delay(20);
    gpioSet(LORA_RST);
    delay(50);

