worrajak/nRF52840/src/main.cpp
    if (!sx1262WaitBusy(2000)) {
        dbg("SX1262: BUSY timeout!");
        updateOLED();
        return false;
    }

    sx1262SetStandby();
    delay(10);

    // Verify chip
    uint8_t pktType = 0x01;
    sx1262WriteCommand(0x8A, &pktType, 1);
    delay(5);
    uint8_t syncH = sx1262ReadRegister(0x0740);
    dbgf("SX1262 sync: 0x%02X", syncH);
    updateOLED();

    if (syncH == 0x00 || syncH == 0xFF) {
        dbg("SX1262: not found!");
        updateOLED();
        return false;
    }

    configureLoRaModem();
    setModeRx();
    attachInterrupt(digitalPinToInterrupt(LORA_IRQ), lora_isr, RISING);
    dbgf("SX1262: OK N:%d", THIS_NODE_ADDRESS);
#endif

#ifdef USE_RFM95
    dbg("RFM95: init...");
    updateOLED();
    delay(10);

    // Reset
    dbg("RFM95: reset...");
    updateOLED();
    gpioClear(LORA_RST);
    delay(10);
    gpioSet(LORA_RST);
    delay(10);

    // Set sleep mode first, then LoRa mode
    rfm95WriteReg(RFM95_REG_OPMODE, 0x00);  // FSK sleep
    delay(10);
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_SLEEP);  // LoRa sleep
    delay(10);

    // Verify chip — version should be 0x12
    uint8_t ver = rfm95ReadReg(RFM95_REG_VERSION);
    dbgf("RFM95 ver: 0x%02X", ver);
    updateOLED();

    if (ver != 0x12) {
        dbg("RFM95: not found!");
        updateOLED();
        return false;
    }

    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_STANDBY);
    delay(10);

    configureLoRaModem();
    setModeRx();
    attachInterrupt(digitalPinToInterrupt(LORA_IRQ), lora_isr, RISING);
    dbgf("RFM95: OK N:%d", THIS_NODE_ADDRESS);
#endif

    updateOLED();
    return true;
}

// ============ LORA TX (RadioHead compatible) ============
#ifdef FW_MEAS_MODE
// ================= [MEAS] hook สำหรับ meas.h =================
// เฟรมวัด: [TO=0xFF][FROM=node][ID][FLAGS=0]['M'][seq be32][pad...] ยาวคงที่ตาม PL
// receiver อ่าน seq จาก byte 5..8 เมื่อ byte 4 == 'M'
bool meas_hw_send(uint8_t frame_len){
    if(frame_len < 9)   frame_len = 9;
    if(frame_len > MAX_MESSAGE_LEN) frame_len = MAX_MESSAGE_LEN;
    uint8_t pkt[MAX_MESSAGE_LEN];
    uint32_t seq = ++g_measSeq;
    pkt[0]=0xFF; pkt[1]=THIS_NODE_ADDRESS; pkt[2]=(uint8_t)(seq & 0xFF); pkt[3]=0x00;
    pkt[4]='M';
    pkt[5]=(uint8_t)(seq>>24); pkt[6]=(uint8_t)(seq>>16);
    pkt[7]=(uint8_t)(seq>>8);  pkt[8]=(uint8_t)seq;
    for(uint8_t i=9;i<frame_len;i++) pkt[i]=(uint8_t)i;   // padding ที่ทำนายได้
    sendRawPacket(pkt, frame_len);                        // log TX เกิดใน sendRawPacket
    return true;
}

bool meas_hw_set_power(int8_t dbm){
    if(dbm < -9 || dbm > 22) return false;
    applyRadioParams((uint8_t)dbm);
    return true;
}

// SF ปรับ runtime — SetModulationParams (0x8B) พร้อม LowDataRateOptimize
// ⚠️ LDRO ต้องเปิดที่ SF11/12 บน BW125 ไม่งั้นฝั่งรับ decode ไม่ได้ (บั๊กเงียบ)
bool meas_hw_set_sf(uint8_t sf){
    if(sf < 5 || sf > 12) return false;
#ifdef USE_SX1262
    sx1262SetStandby();
    delay(1);
    uint8_t ldro = (sf >= 11) ? 1 : 0;
    uint8_t mp[4] = { sf, 0x04, 0x01, ldro };   // BW 125 kHz, CR 4/5
    sx1262WriteCommand(0x8B, mp, 4);
    currentSF = sf;
    setModeRx();
    return true;
#else
    return false;   // RFM95: ยังไม่รองรับเปลี่ยน SF ตอน runtime
#endif
}

int meas_hw_rssi_inst(){
#ifdef USE_SX1262
    setModeRx();
    delay(5);
    uint8_t r = 0;
    sx1262ReadCommand(0x15, &r, 1);      // GetRssiInst
    return -(int)(r / 2);
#else
    return (int)rfm95ReadReg(0x1B) / -2;  // RegRssiValue (โดยประมาณ)
#endif
}
#endif  // FW_MEAS_MODE

void sendPacket() {
    if (!lora_ok) return;

    char payload[120];
    if (gpsValid) {
        // Include GPS coordinates (6 decimal places ≈ 0.11m precision)
        char latStr[12], lonStr[12];
        dtostrf(myLat, 1, 6, latStr);
        dtostrf(myLon, 1, 6, lonStr);
        snprintf(payload, sizeof(payload), "N:%d|S:%d|T:%d|H:%d|B:%d|LA:%s|LO:%s",
                 THIS_NODE_ADDRESS, txSequenceNum,
                 temperature, humidity, batteryMV, latStr, lonStr);
    } else {
        snprintf(payload, sizeof(payload), "N:%d|S:%d|T:%d|H:%d|B:%d",
                 THIS_NODE_ADDRESS, txSequenceNum,
                 temperature, humidity, batteryMV);
    }

    int payloadLen = strlen(payload);

    uint8_t encrypted[payloadLen + 2];
    xorEncrypt(payload, payloadLen, encrypted);

    uint16_t crc = calculateCRC16(encrypted, payloadLen);
    encrypted[payloadLen] = (crc >> 8) & 0xFF;
    encrypted[payloadLen + 1] = crc & 0xFF;
    uint8_t encLen = payloadLen + 2;

    uint8_t totalLen = 4 + encLen;
    uint8_t packet[totalLen];
    packet[0] = BROADCAST_ADDRESS;
    packet[1] = THIS_NODE_ADDRESS;
    packet[2] = rhMsgId++;
    packet[3] = FLAG_ACK_REQ;  // hop=0, ack_req=1 (origin)
    memcpy(&packet[4], encrypted, encLen);

    // Apply adaptive radio params before TX
    // ใช้ silence timeout + RSSI-based power
    // (ACK feedback จะใส่เมื่อมี Gateway — Phase 1)
    // [MEAS] โหมดวัดตรึงกำลังส่ง — adaptive power (7→17 dBm ตาม RSSI) ทำให้
    // RSSI-vs-distance กลายเป็นลูปป้อนกลับ ไม่ใช่ path loss ล้วน
    if (adaptiveRadio && !MEAS_FREEZE_POWER) {
        uint8_t pwr;
        if (millis() - lastHeardTime > SILENCE_TIMEOUT_MS) {
            // เงียบเกิน 5 นาที → อาจไม่มีใครได้ยินเรา → ส่งแรงสุด
            pwr = ADAPTIVE_POWER_MAX;
            dbg("ADAPT: silence → max");
        } else {
            int16_t refRssi = (lastRxValid && lastRxRssi < 0) ? lastRxRssi : rssiSourceClose;
            pwr = rssiToTxPower(refRssi);
        }
        applyRadioParams(pwr);
    }

    // Standby → Buffer → TX
    bool sent = false;
#ifdef USE_SX1262
    sx1262SetStandby();
    delay(2);
    uint8_t pktParams[6] = {0x00, 0x08, 0x00, (uint8_t)totalLen, 0x01, 0x00};
    sx1262WriteCommand(0x8C, pktParams, 6);
    sx1262WriteBuffer(0x00, packet, totalLen);
    sx1262ClearIrqStatus();
    uint8_t txP[3] = {0x00, 0x00, 0x00};
    sx1262WriteCommand(0x83, txP, 3);
    { uint32_t txStart = millis();
    while (millis() - txStart < 2000) {
        uint16_t irq = sx1262GetIrqStatus();
        if (irq & 0x0001) { sx1262ClearIrqStatus(); sent = true; break; }
        delay(1);
    } }
#endif
#ifdef USE_RFM95
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_STANDBY);
    delay(2);
    rfm95WriteReg(RFM95_REG_FIFO_ADDR_PTR, 0x00);
    rfm95WriteBurst(RFM95_REG_FIFO, packet, totalLen);
    rfm95WriteReg(RFM95_REG_PAYLOAD_LEN, totalLen);
    rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
    rfm95WriteReg(RFM95_REG_OPMODE, RFM95_MODE_TX);
    { uint32_t txStart = millis();
    while (millis() - txStart < 2000) {
        if (rfm95ReadReg(RFM95_REG_IRQ_FLAGS) & RFM95_IRQ_TX_DONE) {
            rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
            sent = true; break;
        }
        delay(1);
    } }
#endif
    setModeRx();

    if (sent) {
        dbgf("TX S:%d OK", txSequenceNum);
    } else {
        dbg("TX: timeout!");
    }

    ownTxAttempted = true;
    lastOwnTxOk = sent;
    txSequenceNum++;
    updateOLED();
}

// ============ LORA RX (RadioHead compatible) ============
void receivePacket() {
    if (!lora_ok || !lora_rx_flag) return;
    lora_rx_flag = false;

    uint8_t rxLen = 0;
    int16_t rssi = 0;
    uint8_t packet[MAX_MESSAGE_LEN + 4];

#ifdef USE_SX1262
    uint16_t irqFlags = sx1262GetIrqStatus();
    bool sx1262CrcFail = (irqFlags & 0x0040);
    if (!(irqFlags & 0x0002)) {
        sx1262ClearIrqStatus();
        setModeRx();
        return;
    }
    uint8_t rxStatus[2];
    sx1262ReadCommand(0x13, rxStatus, 2);
    rxLen = rxStatus[0];
    uint8_t rxStartAddr = rxStatus[1];
    if (rxLen < 7 || rxLen > MAX_MESSAGE_LEN) {
        sx1262ClearIrqStatus(); setModeRx(); return;
    }
    sx1262ReadBuffer(rxStartAddr, packet, rxLen);
    uint8_t pktStatus[3];
    sx1262ReadCommand(0x14, pktStatus, 3);
    rssi = -(int16_t)pktStatus[0] / 2;
    // [MEAS] ไบต์ที่ 2 และ 3 อ่านมาอยู่แล้วแต่โค้ดเดิมทิ้ง — SnrPkt (quarter-dB) และ SignalRssiPkt
    lastRxSnrQ4      = (int16_t)(int8_t)pktStatus[1];
    lastRxSignalRssi = -(int16_t)pktStatus[2] / 2;
#ifdef FW_MEAS_MODE
    {   // log ทุกเฟรมที่วิทยุรับได้ รวมที่ CRC เสีย — เฟรมพังคือข้อมูลขอบ coverage
        uint32_t mseq = (rxLen >= 9 && packet[4] == 'M')
            ? ((uint32_t)packet[5] << 24 | (uint32_t)packet[6] << 16 |
               (uint32_t)packet[7] << 8  | (uint32_t)packet[8]) : 0;
        meas_log_rx(packet[1], mseq, (rxLen >= 5 ? (char)packet[4] : '?'),
                    (uint8_t)(packet[3] & 0x0F), (uint8_t)rxLen,
                    !sx1262CrcFail, rssi, lastRxSnrQ4, lastRxSignalRssi);
    }
#endif
    if (sx1262CrcFail) {
        // Log CRC-failed packet with RSSI only
        logRssiSample(0, 0, 0, rssi, 0, RELAY_STATUS_DROP_CRC, RSSI_LOG_FLAG_CRC_FAIL);
        sx1262ClearIrqStatus();
        setModeRx();
        return;
    }
#endif

#ifdef USE_RFM95
    uint8_t irqFlags = rfm95ReadReg(RFM95_REG_IRQ_FLAGS);
    bool rfm95CrcFail = (irqFlags & RFM95_IRQ_CRC_ERROR);
    if (!(irqFlags & RFM95_IRQ_RX_DONE)) {
        rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
        setModeRx();
        return;
    }
    rxLen = rfm95ReadReg(RFM95_REG_RX_NB_BYTES);
    if (rxLen < 7 || rxLen > MAX_MESSAGE_LEN) {
        rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF); setModeRx(); return;
    }
    rfm95WriteReg(RFM95_REG_FIFO_ADDR_PTR, rfm95ReadReg(RFM95_REG_FIFO_RX_CURR));
    rfm95ReadBurst(RFM95_REG_FIFO, packet, rxLen);
    rssi = (int16_t)rfm95ReadReg(RFM95_REG_PKT_RSSI) - 157;
    // [MEAS] RegPktSnrValue เป็น int8 หน่วย quarter-dB เหมือน SX1262
    lastRxSnrQ4      = (int16_t)(int8_t)rfm95ReadReg(RFM95_REG_PKT_SNR);
    lastRxSignalRssi = rssi;   // RFM95 ไม่มี signal-RSSI แยก
#ifdef FW_MEAS_MODE
    {   uint32_t mseq = (rxLen >= 9 && packet[4] == 'M')
            ? ((uint32_t)packet[5] << 24 | (uint32_t)packet[6] << 16 |
               (uint32_t)packet[7] << 8  | (uint32_t)packet[8]) : 0;
        meas_log_rx(packet[1], mseq, (rxLen >= 5 ? (char)packet[4] : '?'),
                    (uint8_t)(packet[3] & 0x0F), (uint8_t)rxLen,
                    !rfm95CrcFail, rssi, lastRxSnrQ4, lastRxSignalRssi);
    }
#endif
    if (rfm95CrcFail) {
        // Log CRC-failed packet with RSSI only
        logRssiSample(0, 0, 0, rssi, 0, RELAY_STATUS_DROP_CRC, RSSI_LOG_FLAG_CRC_FAIL);
        rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
        setModeRx();
        return;
    }
#endif

    // Parse RadioHead header
    uint8_t rhTo    = packet[0];
    uint8_t rhFrom  = packet[1];
    uint8_t rhFlags = packet[3];
    uint8_t hopCount = rhFlags & 0x0F;

    if (rhTo != BROADCAST_ADDRESS && rhTo != THIS_NODE_ADDRESS) {
        setModeRx();
        return;
    }

