worrajak/nRF52840/src/main.cpp
    // Log RSSI sample BEFORE CRC check — catches weak-signal packets too
    // Use rhFrom from header as source (payload not yet decrypted)
    {
        uint8_t logFlags = 0;
        if (hopCount > 0) logFlags |= RSSI_LOG_FLAG_RELAYED;
        logRssiSample(rhFrom, rhFrom, hopCount, rssi, 0,
                       RELAY_STATUS_IDLE, logFlags);
    }

    uint8_t dataLen = rxLen - 4;
    if (dataLen < 3) {
        setModeRx();
        return;
    }

    // Verify CRC16
    uint8_t encLen = dataLen - 2;
    uint16_t receivedCRC = ((uint16_t)packet[4 + encLen] << 8) | packet[4 + encLen + 1];
    uint16_t calcCRC = calculateCRC16(&packet[4], encLen);

    if (receivedCRC != calcCRC) {
        // Mark the last log entry as CRC_FAIL
        uint16_t prevIdx = (rssiLogHead == 0) ? RSSI_LOG_SIZE - 1 : rssiLogHead - 1;
        rssiLog[prevIdx].flags |= RSSI_LOG_FLAG_CRC_FAIL;
        strncpy(lastRelayStatus, "DROP-CRC", sizeof(lastRelayStatus));
        dbg("RX: CRC fail!");
        setModeRx();
        updateOLED();
        return;
    }

    // Decrypt
    char decrypted[encLen + 1];
    xorDecrypt(&packet[4], encLen, decrypted);

    // Parse source node + sequence + sensor values
    uint8_t srcNode = 0;
    uint8_t seqNum = 0;
    int16_t rxTemp = 0;
    int16_t rxHum = 0;
    uint16_t rxBat = 0;
    String msg = String(decrypted);

    int nPos = msg.indexOf("N:");
    if (nPos != -1) {
        int pipe = msg.indexOf("|", nPos);
        if (pipe != -1) srcNode = msg.substring(nPos + 2, pipe).toInt();
    }
    int sPos = msg.indexOf("S:");
    if (sPos != -1) {
        int pipe = msg.indexOf("|", sPos);
        if (pipe != -1) seqNum = msg.substring(sPos + 2, pipe).toInt();
    }
    int tPos = msg.indexOf("T:");
    if (tPos != -1) {
        int pipe = msg.indexOf("|", tPos);
        if (pipe != -1) rxTemp = msg.substring(tPos + 2, pipe).toInt();
    }
    int hPos = msg.indexOf("H:");
    if (hPos != -1) {
        int pipe = msg.indexOf("|", hPos);
        if (pipe != -1) rxHum = msg.substring(hPos + 2, pipe).toInt();
    }
    int bPos = msg.indexOf("B:");
    if (bPos != -1) {
        int pipe = msg.indexOf("|", bPos);
        if (pipe != -1) rxBat = msg.substring(bPos + 2, pipe).toInt();
        else rxBat = msg.substring(bPos + 2).toInt();
    }

    // STM32 node ใส่ SIM:1 เมื่อ BME280 ไม่ตอบ (ค่าจำลอง ไม่ใช่ค่าวัดจริง)
    bool isSim = (msg.indexOf("SIM:1") != -1);

    // Parse GPS if present
    double rxLat = 0.0, rxLon = 0.0;
    int laPos = msg.indexOf("LA:");
    if (laPos != -1) {
        int pipe = msg.indexOf("|", laPos);
        if (pipe != -1) rxLat = msg.substring(laPos + 3, pipe).toFloat();
        else rxLat = msg.substring(laPos + 3).toFloat();
    }
    int loPos = msg.indexOf("LO:");
    if (loPos != -1) {
        int pipe = msg.indexOf("|", loPos);
        if (pipe != -1) rxLon = msg.substring(loPos + 3, pipe).toFloat();
        else rxLon = msg.substring(loPos + 3).toFloat();
    }

    // Track node position
    if (srcNode != 0 && srcNode != THIS_NODE_ADDRESS) {
        updateTrackedNode(srcNode, rxLat, rxLon, rssi);
    }

    lastRxValid = true;
    lastRxNode = srcNode;
    lastRxFrom = rhFrom;
    lastRxHop = hopCount;
    lastRxRssi = rssi;
    lastRxTemp = rxTemp;
    lastRxHum = rxHum;
    lastRxBat = rxBat;
    lastHeardTime = millis();  // อัปเดต silence timeout

    dbgf("RX N:%d S:%d R:%d H:%d", srcNode, seqNum, rssi, hopCount);
    dbgf(" T:%d H:%d%% B:%dmV", rxTemp, rxHum, rxBat);
    if (rxLat != 0.0 && rxLon != 0.0 && gpsValid) {
        double dist = haversineDistance(myLat, myLon, rxLat, rxLon);
        float brng = bearingTo(myLat, myLon, rxLat, rxLon);
        if (dist < 1000) {
            dbgf(" N%d:%.0fm %s", srcNode, dist, bearingToCompass(brng));
        } else {
            dbgf(" N%d:%.1fkm %s", srcNode, dist / 1000.0, bearingToCompass(brng));
        }
    }
    Serial.print(F("[RX from:"));
    Serial.print(rhFrom);
    Serial.print(F(" src:"));
    Serial.print(srcNode);
    Serial.print(F(" hop:"));
    Serial.print(hopCount);
    Serial.print(F(" rssi:"));
    Serial.print(rssi);
    if (isSim) Serial.print(F(" SIM"));
    Serial.print(F("] "));
    Serial.println(decrypted);   // รวม VIA chain "|V:<relay>,<rssi>" ถ้ามี

    // ---- Parse ACK payload for relay/cancel ----
    // ACK format: "ACK:<src>|S:<seq>|GW:<gw_id>"
    bool isAck = msg.startsWith("ACK:");
    uint8_t ackSrcNode = 0;
    uint8_t ackSeqNum = 0;

    // Update previous log entry with ACK flag if applicable
    // (the sample was already logged before CRC check)
    {
        uint16_t prevIdx = (rssiLogHead == 0) ? RSSI_LOG_SIZE - 1 : rssiLogHead - 1;
        rssiLog[prevIdx].srcNode = srcNode;  // update src from decrypted payload
        if (isAck) rssiLog[prevIdx].flags |= RSSI_LOG_FLAG_ACK;
    }

    if (isAck) {
        // ACK:<src> — extract the original source node
        int colon = msg.indexOf(":");
        int pipe = msg.indexOf("|", colon);
        if (pipe != -1) {
            ackSrcNode = msg.substring(colon + 1, pipe).toInt();
        } else {
            ackSrcNode = msg.substring(colon + 1).toInt();
        }
        int sPos = msg.indexOf("S:");
        if (sPos != -1) {
            int sPipe = msg.indexOf("|", sPos);
            if (sPipe != -1) ackSeqNum = msg.substring(sPos + 2, sPipe).toInt();
            else ackSeqNum = msg.substring(sPos + 2).toInt();
        }
        // Cancel any pending forward of the original data packet
        if (ackSrcNode != 0) {
            cancelFromQueue(ackSrcNode, ackSeqNum);
        }
    }

    // ---- Cancel-on-heard: if this packet is in our forward queue, cancel ----
    // (for non-ACK packets — ACKs cancel via ackSrcNode/ackSeqNum above)
    if (!isAck) {
        cancelFromQueue(srcNode, seqNum);
    }

    // ---- Adaptive RSSI threshold ----
    // Feed every valid RX RSSI into EMA to adapt RSSI_SOURCE_CLOSE
    updateRssiThreshold(rssi);

    // ---- Path success tracking ----
    // Record that we saw a packet from this source
    if (srcNode != 0 && srcNode != THIS_NODE_ADDRESS) {
        recordPathSeen(srcNode);
    }

    // If we hear a relay (hop>0) or ACK for a source, that's a success signal
    if (hopCount > 0 && !isAck && srcNode != 0 && srcNode != THIS_NODE_ADDRESS) {
        // This packet was relayed by someone → source's path is working
        recordPathSuccess(srcNode);
    }
    if (isAck && ackSrcNode != 0) {
        // ACK means the data reached GW → source's path succeeded
        recordPathSuccess(ackSrcNode);
    }

