worrajak/nRF52840/src/main.cpp
    // ---- Relay logic ----
    // Guard: skip if this is our own data (echo from another relay)
    if (srcNode == THIS_NODE_ADDRESS || rhFrom == THIS_NODE_ADDRESS) {
        strncpy(lastRelayStatus, "DROP-ECHO", sizeof(lastRelayStatus));
        dbgf("RX: own echo N:%d skip", srcNode);
    } else if (isAck && ackSrcNode == THIS_NODE_ADDRESS) {
        // ACK is for us — don't relay further
        strncpy(lastRelayStatus, "ACK-RCVD", sizeof(lastRelayStatus));
        dbgf("RX: ACK for us N:%d S:%d", ackSrcNode, ackSeqNum);
    } else if (isAck && ackSrcNode == 0) {
        // Malformed ACK — can't determine original source
        strncpy(lastRelayStatus, "DROP-ACK", sizeof(lastRelayStatus));
        dbg("RX: bad ACK skip");
    } else if (srcNode == 0 && !isAck) {
        strncpy(lastRelayStatus, "DROP-PARSE", sizeof(lastRelayStatus));
        dbg("RX: bad parse skip");
    } else {
        // For ACKs: use (ackSrcNode, ackSeqNum) for duplicate check
        // to avoid collision with the original data packet's cache entry
        uint8_t dupSrc = isAck ? ackSrcNode : srcNode;
        uint8_t dupSeq = isAck ? ackSeqNum : seqNum;

        if (isMessageDuplicate(dupSrc, dupSeq)) {
            strncpy(lastRelayStatus, "DROP-DUP", sizeof(lastRelayStatus));
            dbg("RX: dup skip");
        } else {
            addToRelayCache(dupSrc, dupSeq);

            if (hopCount < MAX_HOPS) {
                // Decision logic:
                //   ML mode: predictRelay() uses trained neural network
                //   Rule mode: hop=0 (origin) → relay only if RSSI < adaptive threshold
                bool shouldRelay = true;
                
                if (mlMode) {
                    // ML-based decision using 3-layer neural network
                    float raw[4] = { (float)rssi, (float)srcNode, (float)rhFrom, (float)THIS_NODE_ADDRESS };
                    float prob = mlPredictRelay(raw);
                    mlProbPct = (uint8_t)(prob * 100.0f);
                    if (prob < 0.5f) {
                        shouldRelay = false;
                        strncpy(lastRelayStatus, "NO-RELAY", sizeof(lastRelayStatus));
                        dbgf("ML: skip R:%d prob:%d%% N:%d", rssi, mlProbPct, srcNode);
                    } else {
                        dbgf("ML: relay R:%d prob:%d%% N:%d", rssi, mlProbPct, srcNode);
                    }
                } else {
                    // Rule-based: source close → skip relay
                    if (hopCount == 0 && rssi >= rssiSourceClose) {
                        shouldRelay = false;
                        strncpy(lastRelayStatus, "NO-RELAY", sizeof(lastRelayStatus));
                        dbgf("RX: src close R:%d thresh:%d N:%d skip relay",
                             rssi, rssiSourceClose, srcNode);
                    }
                }

                if (shouldRelay) {
                    // ต่อ VIA trace: node ที่ทวน + RSSI ที่ได้ยิน hop ก่อนหน้า
                    // gateway ถอดเส้นทางเต็มได้ เช่น 102 -(-105)- 116 -(-98)- 104 - GW
                    // ต้อง re-encrypt เพราะ payload เปลี่ยน (XOR + CRC16 ใหม่)
                    char fwdPayload[MAX_PAYLOAD_LEN + 1];
                    char viaBuf[VIA_ENTRY_MAX_LEN];
                    snprintf(viaBuf, sizeof(viaBuf), "|V:%d,%d",
                             THIS_NODE_ADDRESS, (int)rssi);

                    int baseLen = strlen(decrypted);
                    int viaLen  = strlen(viaBuf);
                    if (baseLen + viaLen <= MAX_PAYLOAD_LEN) {
                        memcpy(fwdPayload, decrypted, baseLen);
                        memcpy(fwdPayload + baseLen, viaBuf, viaLen);
                        fwdPayload[baseLen + viaLen] = '\0';
                    } else {
                        // payload เต็ม - ส่งต่อโดยไม่ต่อ trace ดีกว่าทิ้งข้อมูล
                        int copyLen = (baseLen > MAX_PAYLOAD_LEN) ? MAX_PAYLOAD_LEN : baseLen;
                        memcpy(fwdPayload, decrypted, copyLen);
                        fwdPayload[copyLen] = '\0';
                        dbg("FWD: payload full, VIA omitted");
                    }

                    uint8_t fwdPayloadLen = strlen(fwdPayload);
                    uint8_t fwdEncLen = fwdPayloadLen + 2;
                    uint8_t relayPkt[4 + fwdEncLen];

                    xorEncrypt(fwdPayload, fwdPayloadLen, &relayPkt[4]);
                    uint16_t fwdCRC = calculateCRC16(&relayPkt[4], fwdPayloadLen);
                    relayPkt[4 + fwdPayloadLen]     = (fwdCRC >> 8) & 0xFF;
                    relayPkt[4 + fwdPayloadLen + 1] = fwdCRC & 0xFF;

                    relayPkt[0] = BROADCAST_ADDRESS;
                    relayPkt[1] = THIS_NODE_ADDRESS;
                    relayPkt[2] = rhMsgId++;
                    // Preserve FLAGS bits 4-5 (IS_ACK, ACK_REQ) while incrementing hop
                    relayPkt[3] = ((hopCount + 1) & FLAG_HOP_MASK) |
                                  (rhFlags & ~FLAG_HOP_MASK);

                    addToMessageQueue(relayPkt, 4 + fwdEncLen, dupSrc, dupSeq, rssi);
                    dbgf("FWD N:%d S:%d H:%d>%d R:%d%s",
                         dupSrc, dupSeq, hopCount, hopCount + 1, rssi,
                         isAck ? " ACK" : "");
                }
            } else {
                strncpy(lastRelayStatus, "DROP-HOP", sizeof(lastRelayStatus));
                dbgf("RX: maxhop %d N:%d", hopCount, srcNode);
            }
        }
    }

// Record final decision in RSSI log
    updateLastLogDecision();

#ifdef USE_SX1262
    sx1262ClearIrqStatus();
#endif
#ifdef USE_RFM95
    rfm95WriteReg(RFM95_REG_IRQ_FLAGS, 0xFF);
#endif
    setModeRx();
    updateOLED();
}

// ============ BATTERY ============
float readBattery() {
    analogReadResolution(12);
    uint16_t raw = analogRead(BATTERY_PIN);
    return (raw * REAL_VBAT_MV_PER_LSB) / 1000.0f;
}

// ============ I2C SCAN ============
void scanI2C() {
    uint8_t count = 0;
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire.beginTransmission(addr);
        if (Wire.endTransmission() == 0) {
            dbgf("I2C: 0x%02X found", addr);
            count++;
        }
    }
    dbgf("I2C: %d device(s)", count);
}

// ============ SETUP ============
void setup() {
    pinMode(STATUS_LED, OUTPUT);
    digitalWrite(STATUS_LED, LOW);
    nrf_gpio_cfg_input(UI_BUTTON_PIN, NRF_GPIO_PIN_PULLUP);

