worrajak/nRF52840/src/main.cpp
    Serial.begin(115200);
    delay(2000);
#ifdef USE_SX1262
    Serial.print(F("\n=== nRF52840 LoRa P2P Node "));
    Serial.print(THIS_NODE_ADDRESS);
    Serial.println(F(" (SX1262+BLE) ==="));
#endif
#ifdef USE_RFM95
    Serial.print(F("\n=== nRF52840 LoRa P2P Node "));
    Serial.print(THIS_NODE_ADDRESS);
    Serial.println(F(" (RFM95+BLE) ==="));
#endif

    // I2C
    Wire.setPins(OLED_SDA, OLED_SCL);
    Wire.begin();
    delay(100);

    // OLED
    if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) {
        if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3D)) {
            Serial.println(F("[-] OLED FAILED"));
        } else {
            oled_ok = true;
        }
    } else {
        oled_ok = true;
    }

    if (oled_ok) {
        display.clearDisplay();
        display.setTextSize(2);
        display.setTextColor(SSD1306_WHITE);
        display.setCursor(0, 0);
        display.print(F("Node "));
        display.println(THIS_NODE_ADDRESS);
        display.setTextSize(1);
#ifdef USE_SX1262
        display.println(F("SX1262+BLE init..."));
#endif
#ifdef USE_RFM95
        display.println(F("RFM95+BLE init..."));
#endif
        display.display();
    }

    dbgf("=== Node %d ===", THIS_NODE_ADDRESS);
    dbg(oled_ok ? "OLED: OK" : "OLED: FAIL!");
    updateOLED();

    scanI2C();
    updateOLED();

    // BME280 init
    if (bme.begin(0x76)) {
        bme_ok = true;
    } else if (bme.begin(0x77)) {
        bme_ok = true;
    }
    if (bme_ok) {
        bme.setSampling(Adafruit_BME280::MODE_FORCED,
                        Adafruit_BME280::SAMPLING_X1,
                        Adafruit_BME280::SAMPLING_NONE,
                        Adafruit_BME280::SAMPLING_X1,
                        Adafruit_BME280::FILTER_OFF);
        dbg("BME280: OK");
    } else {
        dbg("BME280: sim mode");
    }
    updateOLED();

    // BLE init (must be before LoRa — NimBLE needs early radio init)
    ble_ok = initBLE();
    dbg(ble_ok ? "BLE: OK" : "BLE: FAIL!");
    updateOLED();

    // LoRa init
    lora_ok = initLoRa();
    if (!lora_ok) {
#ifdef USE_SX1262
        dbg("SX1262: FAILED!");
#endif
#ifdef USE_RFM95
        dbg("RFM95: FAILED!");
#endif
    }
    updateOLED();

    dbg("Ready.");
    updateOLED();

#ifdef FW_MEAS_MODE
    // [MEAS] ปิด adaptive power ทันทีที่บูต — ต้องตรึงกำลังส่งตลอดการวัด
    adaptiveRadio = false;
    applyRadioParams(MEAS_TX_DEF);
    meas_set_self(THIS_NODE_ADDRESS);
    Serial.println(F("# MEASUREMENT BUILD: adaptive power OFF, TX frozen. type HELP"));
#endif

    digitalWrite(STATUS_LED, HIGH);
    delay(1000);
}

// ============ LOOP ============
void loop() {
    static unsigned long lastBat = 0;
    static unsigned long lastDisplay = 0;
    static unsigned long lastTx = 0;

    handleUIButton();
    handleSerialCommand();
    meas_cmd_poll();          // [MEAS] คำสั่งวัด + เดินตาราง SF (ว่างเปล่าเมื่อไม่ใช่ build วัด)

    // RX has priority
    receivePacket();

    // Process relay queue
    processMessageQueue();

    // Battery + BME280 every 2s
    if (millis() - lastBat >= 2000) {
        lastBat = millis();
        batteryVoltage = readBattery();
        batteryMV = (uint16_t)(batteryVoltage * 1000);
        if (bme_ok) {
            bme.takeForcedMeasurement();
            temperature = (int16_t)bme.readTemperature();
            humidity = (int16_t)bme.readHumidity();
        }
    }

    // Update OLED every 1s
    if (millis() - lastDisplay >= 1000) {
        lastDisplay = millis();
        updateOLED();
    }

    // TX every 2 minutes
    if (lora_ok && millis() - lastTx >= TX_INTERVAL) {
        lastTx = millis();
        sendPacket();
    }

#if LOW_POWER_IDLE
    // This blocks only the application loop task. The nRF52840 enters
    // System-ON idle while SX1262 remains in continuous RX and OLED stays on.
    // DIO1 wakes the CPU; button polling resumes within 10 ms.
    delay(CPU_IDLE_SLEEP_MS);
#else
    yield();
#endif
}
